app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Bio"], ["room_number", 234], ["created_at", "2019-10-14 20:59:07.128218"], ["updated_at", "2019-10-14 20:59:07.128218"]]
---
    def create
        @school_class = SchoolClass.new
        @school_class.title = params[:school_class][:title]
        @school_class.room_number = params[:school_class][:room_number]
        @school_class.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 987], ["updated_at", "2019-10-14 21:13:57.034771"], ["id", 4]]
---
    def update
        # binding.pry
        @school_class = SchoolClass.find(params[:id])
        @school_class.update(params.require(:school_class).permit(:title, :room_number))