app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "students".* FROM "students"
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Mustafa"], ["last_name", "Khansi"], ["updated_at", "2019-10-14 20:11:04.049170"], ["id", 1]]
---
    def update
        @student = Student.find(params[:id])
        @student.first_name = params[:student][:first_name]
        @student.last_name = params[:student][:last_name]
        @student.save